# 4. Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y). 

n = int(input('Введите номер четверти плоскости: '))
if(n == 1):
    print('0 < x < +бесконечность и 0 < y < +бесконечность')
elif(n == 2):
    print('-бесконечность < x < 0 и 0 < y < +бесконечность')
elif(n == 3):
    print('-бесконечность < x < 0 и -бесконечность < y < 0')
elif(n == 4):
    print('0 < x < +бесконечность и -бесконечность < y < 0')
else:
    print('такой четверти нет')